# MepEquipmentCalcPipingflowParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepEquipmentCalcPipingflowParam Property
ParameterTypeId Class See Also
---
"Calculated Flow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepEquipmentCalcPipingflowParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepEquipmentCalcPipingflowParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepEquipmentCalcPipingflowParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace